<!-- attach-outputs:plan-nodes-test.txt -->
  <!-- Output: plan-nodes-test.txt -->
  #### plan-nodes-test.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 7, 2026, 02:04 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7411"
        name                                 = "tiles-test-cp"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7421"
        name                                 = "tiles-test-wk"
        tags                                 = []
        # (34 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster.onepassword_item.kubeconfig will be created
  + resource "onepassword_item" "kubeconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-test-kubeconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.talos_cluster_kubeconfig.this will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBMUkySDdCelozM0lPQ1ozSktwTzcwVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNakEzTVRrMU16VTJXaGNOTXpVeE1qQTFNVGsxTXpVMldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUVTcjBrWFdkNDhkcmZqVFlpcnh0anFFWStQa1VXeklSU2R6CkdyMzhadUNMbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRko5R1Q5TFU5eTRLZldEKwo4eFVRTzkzOFJEcWZNQVVHQXl0bGNBTkJBR2EyVkxFalVncm1nVHRBclhCdXZMazFIQWVySVEvenBFQStWLzlQClpuNjZxeHdkeTJVZGZ4U2I5eFY0cVVURDhtcGp3YzFSVzNja25YaHlNcGJDbEFZPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJTMWJHZjBPbVhVdEo5MDU4VDhvUE5NQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXlNRGN4T1RVek5UWmFGdzB5TmpFeU1EY3hPVFV6TlRaYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQVJ1TjVQVlhkZE5KaGhGbzJSNXFtWGdaZnllMFpFNnhYClZESVMveHJpbS8ralNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU2ZSay9TMVBjdUNuMWcvdk1WRUR2ZC9FUTZuekFGQmdNclpYQURRUUM1Q2RKUQpQdDF4V2FXMktUeDF4dEJQN2ZKeG9sM3J6NVVVc3R3UEtUSU4xaXQ3Y2E4c2RWYnRpNm82eDhRUUVBbGdnbnhDClcycUplZVRiRFovQkV3VUYKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + endpoint                        = "10.0.192.11"
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = "10.0.192.11"
    }

  # module.cluster.talos_machine_bootstrap.this will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBMUkySDdCelozM0lPQ1ozSktwTzcwVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNakEzTVRrMU16VTJXaGNOTXpVeE1qQTFNVGsxTXpVMldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQUVTcjBrWFdkNDhkcmZqVFlpcnh0anFFWStQa1VXeklSU2R6CkdyMzhadUNMbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRko5R1Q5TFU5eTRLZldEKwo4eFVRTzkzOFJEcWZNQVVHQXl0bGNBTkJBR2EyVkxFalVncm1nVHRBclhCdXZMazFIQWVySVEvenBFQStWLzlQClpuNjZxeHdkeTJVZGZ4U2I5eFY0cVVURDhtcGp3YzFSVzNja25YaHlNcGJDbEFZPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJTMWJHZjBPbVhVdEo5MDU4VDhvUE5NQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXlNRGN4T1RVek5UWmFGdzB5TmpFeU1EY3hPVFV6TlRaYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQVJ1TjVQVlhkZE5KaGhGbzJSNXFtWGdaZnllMFpFNnhYClZESVMveHJpbS8ralNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU2ZSay9TMVBjdUNuMWcvdk1WRUR2ZC9FUTZuekFGQmdNclpYQURRUUM1Q2RKUQpQdDF4V2FXMktUeDF4dEJQN2ZKeG9sM3J6NVVVc3R3UEtUSU4xaXQ3Y2E4c2RWYnRpNm82eDhRUUVBbGdnbnhDClcycUplZVRiRFovQkV3VUYKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + endpoint             = "10.0.192.11"
      + id                   = (known after apply)
      + node                 = "10.0.192.11"
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7411" -> (known after apply)
      ~ ipv4_addresses                       = [] -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ mac_addresses                        = [
          - "bc:24:11:d0:74:11",
        ] -> (known after apply)
        name                                 = "tiles-test-cp"
      ~ network_interface_names              = [] -> (known after apply)
      ~ started                              = false -> true
        tags                                 = []
        # (28 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7411-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles-test"
                  "network":
                    "podSubnets":
                    - "10.0.208.0/20"
                    "serviceSubnets":
                    - "10.0.200.0/21"
                "version": "v1alpha1"
            EOT,
          + <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT,
          + <<-EOT
                "apiVersion": "v1alpha1"
                "kind": "Layer2VIPConfig"
                "link": "eth0"
                "name": "10.0.192.10"
            EOT,
        ]
      + endpoint                    = "10.0.192.11"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.192.11"
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7421" -> (known after apply)
      ~ ipv4_addresses                       = [] -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ mac_addresses                        = [
          - "bc:24:11:d0:74:21",
        ] -> (known after apply)
        name                                 = "tiles-test-wk"
      ~ network_interface_names              = [] -> (known after apply)
      ~ started                              = false -> true
        tags                                 = []
        # (28 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7421-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles-test"
                  "network":
                    "podSubnets":
                    - "10.0.208.0/20"
                    "serviceSubnets":
                    - "10.0.200.0/21"
                "version": "v1alpha1"
            EOT,
          + <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67:v1.12.0"
            EOT,
        ]
      + endpoint                    = "10.0.192.21"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.192.21"
    }

Plan: 7 to add, 0 to change, 2 to destroy.

  ```

  </details>
  
  